#!/usr/bin/env python
# -*- encoding: utf-8 -*-
"""
@Author  : jzy
@Contact :  : 905414225@qq.com
@Software: PyCharm
@File    : file_util.py
@Time    : 2018/10/15 15:12
@Desc    : http响应工具类
"""

codes={
    200 :None,
    400 :None,
    10001:"登录失败,账号或者密码错误.",
    10002:"当前账号已存在.",
    10003:"当前领域已存在.",
    10004:"当前项目已存在.",
    10005:"已存在此主题词.",
    10006:"当前停用词已存在.",
    10007:"当前维度已存在.",
    10008:"当前内容已存在.",
    10009:"上传失败",
    10010:"删除失败",
    10020:"手机验证码发送失败",
    10021:"手机验证码验证失败",
    10022:"邮箱验证码发送失败",
    10023:"邮箱验证码验证失败",
    10030:"当前模板列数存在异常，请下载最新模板",
    10031:"当前企业已存在，请勿重复创建企业"

}


if __name__ == '__main__':
    pass